geier99/IR-NEC-Reader/inc/atmega48bit.h
/******************************************************************************
*                                                                             *
*   file name      :    atmega48bit.h                                         *
*   file type      :    Header                                                *
*                                                                             *
*   author         :    A.Weick                                               *
*   last change    :    19.08.2008 / A.Weick                                  *
*                                                                             *
*   version        :    REV 0.01                                              *
*                                                                             *
*   Copyright (c) 2008 Andreas Weick                                          *
*                      Alle Rechte vorbehalten.                               *
*                     - Confidential -                                        *
*                                                                             *
*=============================================================================*
*                                                                             *
*   description    :    BIT's Makrodefinitionen für ATtiny48                  *
*                                                                             *
*   specials       :    <description> (more lines posiple)                    *
*                                                                             *
******************************************************************************/

#ifndef __ATMEGA48BIT_H                 
#define __ATMEGA48BIT_H              

/*============================== include files ==============================*/
/* nothing */

/*================================== Makros =================================*/


//--------------------  Gerneral Bit definitions
#define  BIT7   (7)
#define  BIT6   (6)
#define  BIT5   (5)
#define  BIT4   (4)
#define  BIT3   (3)
#define  BIT2   (2) 
#define  BIT1   (1)
#define  BIT0   (0)
//---------------------


// Hinweis Adresse in (...) ist die IO-Adresse  für die Dataspace Adresse muss noch 0x20 dazu addiert werden
// Beispiel ADCL  I/0 Adresse = 0x04,  Dataspace Adresse = 0x24



/* 0x00 - 0x02  reserved */



//########################################################
//#  PINB (0x03)          Input Pins, Port B 

#define PINB7  (7)      // Data Bit
#define PINB6  (6)      // Data Bit
#define PINB5  (5)      // Data Bit
#define PINB4  (4)      // Data Bit
#define PINB3  (3)      // Data Bit
#define PINB2  (2)      // Data Bit
#define PINB1  (1)      // Data Bit
#define PINB0  (0)      // Data Bit


//########################################################
//# DDRB (0x04)          Data Direction Register, Port B 

#define DDB7  (7)       // Data Bit
#define DDB6  (6)       // Data Bit
#define DDB5  (5)       // Data Bit
#define DDB4  (4)       // Data Bit
#define DDB3  (3)       // Data Bit
#define DDB2  (2)       // Data Bit
#define DDB1  (1)       // Data Bit
#define DDB0  (0)       // Data Bit


//########################################################
//# PORTB (0x05)         Data Register, Port B 

#define PB7  (7)       // Data Bit
#define PB6  (6)       // Data Bit
#define PB5  (5)       // Data Bit
#define PB4  (4)       // Data Bit
#define PB3  (3)       // Data Bit
#define PB2  (2)       // Data Bit
#define PB1  (1)       // Data Bit
#define PB0  (0)       // Data Bit
//########################################################




//########################################################
//#  PINC (0x06)          Input Pins, Port C 

#define PINC7  (7)      // Data Bit
#define PINC6  (6)      // Data Bit
#define PINC5  (5)      // Data Bit
#define PINC4  (4)      // Data Bit
#define PINC3  (3)      // Data Bit
#define PINC2  (2)      // Data Bit
#define PINC1  (1)      // Data Bit
#define PINC0  (0)      // Data Bit


//########################################################
//# DDRC (0x07)          Data Direction Register, Port C 

#define DDC7  (7)       // Data Bit
#define DDC6  (6)       // Data Bit
#define DDC5  (5)       // Data Bit
#define DDC4  (4)       // Data Bit
#define DDC3  (3)       // Data Bit
#define DDC2  (2)       // Data Bit
#define DDC1  (1)       // Data Bit
#define DDC0  (0)       // Data Bit


//########################################################
//# PORTC(0x08)         Data Register, Port C 

#define PC7  (7)       // Data Bit
#define PC6  (6)       // Data Bit
#define PC5  (5)       // Data Bit
#define PC4  (4)       // Data Bit
#define PC3  (3)       // Data Bit
#define PC2  (2)       // Data Bit
#define PC1  (1)       // Data Bit
#define PC0  (0)       // Data Bit
//########################################################




//########################################################
//#  PIND (0x09)          Input Pins, Port D 

#define PIND7  (7)      // Data Bit
#define PIND6  (6)      // Data Bit
#define PIND5  (5)      // Data Bit
#define PIND4  (4)      // Data Bit
#define PIND3  (3)      // Data Bit
#define PIND2  (2)      // Data Bit
#define PIND1  (1)      // Data Bit
#define PIND0  (0)      // Data Bit


//########################################################
//# DDRD (0x0A)          Data Direction Register, Port D

#define DDD7  (7)       // Data Bit
#define DDD6  (6)       // Data Bit
#define DDD5  (5)       // Data Bit
#define DDD4  (4)       // Data Bit
#define DDD3  (3)       // Data Bit
#define DDD2  (2)       // Data Bit
#define DDD1  (1)       // Data Bit
#define DDD0  (0)       // Data Bit


//########################################################
//# PORTD(0x0B)         Data Register, Port D 

#define PD7  (7)       // Data Bit
#define PD6  (6)       // Data Bit
#define PD5  (5)       // Data Bit
#define PD4  (4)       // Data Bit
#define PD3  (3)       // Data Bit
#define PD2  (2)       // Data Bit
#define PD1  (1)       // Data Bit
#define PD0  (0)       // Data Bit
//########################################################


