geier99/IR-NEC-Reader/inc/atmega48bit.h
//########################## 
//# 0x29   reserved        #
//##########################


//############################################################             
//# GPIOR1  (0x2A)   GPIOR1 – General Purpose I/O Register 1 #
//# GPIOR2  (0x2B)   GPIOR2 – General Purpose I/O Register 2 #
//# gleiche Bitdefinitionen wie oben bei GPIOR0              #
//############################################################



//############################################
//# SPCR  (0x2C)        SPCR – SPI Control Register 

#define SPIE  (7)     // SPI Interrupt Enable
#define SPE   (6)     // SPI Enable
#define DORD  (5)     // Data Order
#define MSTR  (4)     // Master/Slave Select
#define CPOL  (3)     // Clock Polarity
#define CPHA  (2)     // Clock Phase
#define SPR1  (1)     // SPI Clock Rate Select Bits
#define SPR0  (0)     // '


//############################################             
//# SPSR  (0x2D)        SPSR – SPI Status Register 

#define SPIF   (7)     // SPI Interrupt Flag
#define WCOL   (6)     // Write COLlision Flag
/* bits 5-1 reserved , read as zero*/
#define SPI2X    (0)     // Double SPI Speed Bit


//############################################
//# SPDR  (0x2E)        SPDR – SPI Data Register 

#define SPDR7  (7)     // Data Bit
#define SPDR6  (6)     // Data Bit
#define SPDR5  (5)     // Data Bit
#define SPDR4  (4)     // Data Bit
#define SPDR3  (3)     // Data Bit
#define SPDR2  (2)     // Data Bit
#define SPDR1  (1)     // Data Bit
#define SPDR0  (0)     // Data Bit


//########################## 
//# 0x2F   reserved        #
//##########################


//######################################################################
//# ACSR (0x30)          Analog Comparator Control and Status Register 

#define ACD     (7)     // Analog Comparator Disable
#define ACBG    (6)     // Analog Comparator Bandgap Select
#define ACO     (5)     // Analog Comparator Output
#define ACI     (4)     // Analog Comparator Interrupt Flag
#define ACIE    (3)     // Analog Comparator Interrupt Enable
#define ACIC    (2)     // Analog Comparator Input Capture Enable
#define ACIS1   (1)     // Analog Comparator Interrupt Mode Select Bits
#define ACIS0   (0)     // '


//########################## 
//# 0x31  - 0x32  reserved #
//##########################


//############################################             
//# SMCR  (0x33)   SMCR – Sleep Mode Control Register 

/* bits 7-4 reserved , read as zero*/
#define SM2   (3)     // Sleep Mode Select Bits
#define SM1   (2)     // '
#define SM0   (1)     // '
#define SE    (0)     // Sleep Enable


//############################################             
//# MCUSR (0x34)    MCUSR – MCU Status Register 

// bit 7-4   reserved , read as zero
#define WDRF    (3)     // Watchdog System Reset Flag
#define BORF    (2)     // Brown-out Reset Flag
#define EXTRF   (1)     // External Reset Flag
#define PORF    (0)     // Power-on Reset Flag   



//############################################             
//# MCUCR   (0x35))  MCU Control Register

// bit 7 - 5   reserved , read as zero
#define PUD     (4)     // Pull-up Disable            
// bit 3-2 reserved , read as zero
#define IVSEL   (1)     // Interrupt Vector Select
#define IVCE    (0)     // Interrupt Vector Change Enable



//########################## 
//# 0x36   reserved        #
//##########################



//######################################################################
//# SPMCSR (0x37)          SPMCSR – Store Program Memory Control and Status Register 

#define SPMIE     (7)     // SPM Interrupt Enable
#define RWWSB     (6)     // Read-While-Write Section Busy  (It will always read as zero in ATmega48)
// bit  5   reserved , read as zero
#define RWWSRE    (4)     // Read-While-Write Section Read Enable (für Atmega48 Datasheet beachten)
#define BLBSET    (3)     // Boot Lock Bit Set
#define PGWRT     (2)     // Page Write
#define PGERS     (1)     // Page Erase
#define SELFPRGEN (0)     // Self Programming Enable


//########################## 
//# 0x38  - 0x3C  reserved #
//##########################




//######################################################################
//# SPL   (0x3D) Stack Pointer Low Register        Initial Value= RAMEND
 
#define SP7  (7)     // Data Bit
#define SP6  (6)     // Data Bit
#define SP5  (5)     // Data Bit
#define SP4  (4)     // Data Bit
#define SP3  (3)     // Data Bit
#define SP2  (2)     // Data Bit
#define SP1  (1)     // Data Bit
#define SP0  (0)     // Data Bit

//######################################################################
//# SPH   (0x3E) Stack Pointer High Register     Initial Value= RAMEND

/* reserved read as zero 
#define SP15  (7)     // Data Bit
#define SP14  (6)     // Data Bit
#define SP13  (5)     // Data Bit
#define SP12  (4)     // Data Bit
#define SP11  (3)     // Data Bit
*/
#define SP10  (2)     // Data Bit   (nicht für ATMEGA 48 ==> read as 0)
#define SP9   (1)     // Data Bit
#define SP8   (0)     // Data Bit


//############################################             
//# SREG   (0x3F) Status Register     

#define I   (7)     // Global Interrupt Enable
#define T   (6)     // Bit Copy Storage
#define H   (5)     // Half Carry Flag
#define S   (4)     // Sign Bit, S = N . V
#define V   (3)     // Two’s Complement Overflow Flag
#define N   (2)     // Negative Flag
#define Z   (1)     // Zero Flag
#define C   (0)     // Carry Flag


//################## ab hier extende IO-Space   ab SRAM - Adresse 0x60 ###########################
//For the Extended I/O space from 0x60 - 0xFF in SRAM, only the ST/STS/STD and LD/LDS/LDD
//instructions can be used.

// Hinweis: ab hier ist die  Adresse in (...) jetzt die Dataspace-Adresse   



//############################################
//# WDTCSR   (0x60) SRAM       WDTCSR – Watchdog Timer Control Register 

#define WDIF   (7)     // Watchdog Interrupt Flag
#define WDIE   (6)     // Watchdog Interrupt Enable
#define WDP3   (5)     // Watchdog Timer Prescaler Bit3
#define WDCE   (4)     // Watchdog Change Enable
#define WDE    (3)     // Watchdog System Reset Enable
#define WDP2   (2)     // Watchdog Timer Prescaler Bits
#define WDP1   (1)     // '
#define WDP0   (0)     // '


//######################################################################
//# CLKPR (0x61) SRAM    CLKPR – Clock Prescale Register 

#define CLKPCE     (7)     // Clock Prescaler Change Enable
// bit 6-4   reserved , read as zero
#define CLKPS3     (3)     // Clock Prescaler Select Bits
#define CLKPS2     (2)     // '
#define CLKPS1     (1)     // '
#define CLKPS0     (0)     // '


