geier99/IR-NEC-Reader/inc/atmega48bit.h
//################################# 
//# 0x62  - 0x63 (SRAM)  reserved #
//#################################


//######################################################################
//# PRR (0x64) SRAM    PRR – Power Reduction Register 

#define PRTWI     (7)     // Power Reduction TWI
#define PRTIM2    (6)     // Power Reduction Timer/Counter2
#define PRTIM0    (5)     // Power Reduction Timer/Counter0
// bit 4   reserved , read as zero
#define PRTIM1    (3)     // Power Reduction Timer/Counter1
#define PRSPI     (2)     // Power Reduction Serial Peripheral Interface
#define PRUSART0  (1)     // Power Reduction USART0
#define PRADC     (0)     // Power Reduction ADC


//######################## 
//# 0x65 (SRAM)  reserved #
//########################



//############################################
//# OSCCAL (0x66) SRAM  Oscillator Calibration Register  

#define CAL7    (7)     // Data Bit
#define CAL6    (6)     // Data Bit
#define CAL5    (5)     // Data Bit
#define CAL4    (4)     // Data Bit
#define CAL3    (3)     // Data Bit
#define CAL2    (2)     // Data Bit
#define CAL1    (1)     // Data Bit
#define CAL0    (0)     // Data Bit


//######################### 
//# 0x67 (SRAM)  reserved #
//#########################


//######################################################################
//# PCICR (0x68) SRAM  PCICR – Pin Change Interrupt Control Register 

// bit 7- 3   reserved , read as zero
#define PCIE2     (2)     // Pin Change Interrupt Enable 2
#define PCIE1     (1)     // Pin Change Interrupt Enable 1
#define PCIE0     (0)     // Pin Change Interrupt Enable 0



//######################################################################
//# EICRA (0x69) SRAM  EICRA – External Interrupt Control Register A 

// bit 7- 4   reserved , read as zero
#define ISC11     (3)     // Interrupt Sense Control 1 Bits
#define ISC10     (2)     // '
#define ISC01     (1)     // Interrupt Sense Control 0 Bits
#define ISC00     (0)     // '


//######################### 
//# 0x6A (SRAM)  reserved #
//#########################


//############################################
//# PCMSK0 (0x6B) SRAM  PCMSK0 – Pin Change Mask Register 0  

#define M_PCINT7    (7)     // Pin Change Enable Mask Bits
#define M_PCINT6    (6)     // '
#define M_PCINT5    (5)     // '
#define M_PCINT4    (4)     // '
#define M_PCINT3    (3)     // '
#define M_PCINT2    (2)     // '
#define M_PCINT1    (1)     // '
#define M_PCINT0    (0)     // '


//############################################
//# PCMSK1 (0x6C) SRAM  PCMSK1 – Pin Change Mask Register 1  

// bit 7   reserved , read as zero
#define PCINT14    (6)     // Pin Change Enable Mask Bits
#define PCINT13    (5)     // '
#define PCINT12    (4)     // '
#define PCINT11    (3)     // '
#define PCINT10    (2)     // '
#define PCINT9     (1)     // '
#define PCINT8     (0)     // '


//############################################
//# PCMSK2 (0x6D) SRAM  PCMSK2 – Pin Change Mask Register 2  

#define PCINT23    (7)     // Pin Change Enable Mask Bits
#define PCINT22    (6)     // '
#define PCINT21    (5)     // '
#define PCINT20    (4)     // '
#define PCINT19    (3)     // '
#define PCINT18    (2)     // '
#define PCINT17    (1)     // '
#define PCINT16    (0)     // '


//######################################################################
//# TIMSK0 (0x6E) SRAM  TIMSK0 – Timer/Counter0 Interrupt Mask Register 

// bit 7- 3   reserved , read as zero
#define OCIE0B     (2)     // Timer/Counter0 Output Compare Match B Interrupt Enable
#define OCIE0A     (1)     // Timer/Counter0 Output Compare Match A Interrupt Enable
#define TOIE0      (0)     // Timer/Counter0 Overflow Interrupt Enable



//######################################################################
//# TIMSK1 (0x6F) SRAM  TIMSK1 – Timer/Counter0 Interrupt Mask Register 

// bit 7- 6   reserved , read as zero
#define ICIE1     (5)     // Timer/Counter1, Input Capture Interrupt Enable
// bit 4- 3   reserved , read as zero
#define OCIE1B     (2)     // Timer/Counter1, Output Compare B Match Interrupt Enable
#define OCIE1A     (1)     // Timer/Counter1, Output Compare A Match Interrupt Enable
#define TOIE1      (0)     // Timer/Counter1, Overflow Interrupt Enable



//######################################################################
//# TIMSK2 (0x70) SRAM  TIMSK2 – Timer/Counter2 Interrupt Mask Register 

// bit 7- 3   reserved , read as zero
#define OCIE2B     (2)     // Timer/Counter2 Output Compare Match B Interrupt Enable
#define OCIE2A     (1)     // Timer/Counter2 Output Compare Match A Interrupt Enable
#define TOIE2      (0)     // Timer/Counter2 Overflow Interrupt Enable


//################################# 
//# 0x71  - 0x77 (SRAM)  reserved #
//#################################



//########################################################
//# ADCL   (0x78) SRAM     ADC Data Register Low Byte*/ 

//# Hinweis: - Definition sind nur gültig für ADLAR=0   Default, Ergebnis rechtsausgerichtet 
//#          - Immer zuerst ADCL lesen, bevor ADCH gelesen wird 
//#
        #define  ADC7   (7)
        #define  ADC6   (6)
        #define  ADC5   (5)
        #define  ADC4   (4)
        #define  ADC3   (3)
        #define  ADC2   (2) 
        #define  ADC1   (1)
        #define  ADC0   (0)
//########################################################



//########################################################
//#   ADCH   (0x79)  SRAM     ADC Data Register High Byte */ 

//   Hinweis: Definition sind nur gültig für ADLAR=0   Default, Ergebnis rechtsausgerichtet 
//            - Immer zuerst ADCL lesen, bevor ADCH gelesen wird 


/* bits 7-2 reserved , read as zero*/

#define  ADC9   (1)     
#define  ADC8   (0)     




//########################################################
//# ADCSRA (0x7A)  SRAM        ADC Control and Status Register A 

#define ADEN    (7)     // ADC Enable
#define ADSC    (6)     // ADC Start Conversion
#define ADATE   (5)     // ADC Auto Trigger Enable
#define ADIF    (4)     // ADC Interrupt Flag
#define ADIE    (3)     // ADC Interrupt Enable
#define ADPS2   (2)     // ADC Prescaler Select Bits
#define ADPS1   (1)     //  '
#define ADPS0   (0)     //  '



//########################################################
//# ADCSRB (0x7B)  SRAM        ADC Control and Status Register B 

/* bit 7 reserved , read as zero*/
#define ACME    (6)     // Analog Comparator Multiplexer Enable

