geier99/IR-NEC-Reader/inc/atmega48bit.h
//################################# 
//# 0x8C  - 0xAF (SRAM)  reserved #
//#################################



//############################################
//# TCCR2A  (0xB0) SRAM    Timer/Counter 2 Control Register A  

#define COM2A1  (7)     // Compare Output Mode for Channel A, Bit 1 
#define COM2A0  (6)     // Compare Output Mode for Channel A, Bit 0
#define COM2B1  (5)     // Compare Output Mode for Channel B, Bit 1
#define COM2B0  (4)     // Compare Output Mode for Channel B, Bit 0
/* bits 3-2  reserved , read as zero*/
#define WGM21   (1)     // Waveform Generation Mode Bit 1
#define WGM20   (0)     // Waveform Generation Mode Bit 0  


//############################################
//# TCCR2B  (0xB1) SRAM       Timer/Counter2 Control Register B 

#define FOC2A    (7)     // Force Output Compare A
#define FOC2B    (6)     // Force Output Compare B
// bits 5 - 4 reserved , read as zero, write as zero
#define WGM22    (3)     // Waveform Generation Mode
#define CS22     (2)     // Clock Select Bits
#define CS21     (1)     // '
#define CS20     (0)     // '



//############################################
//# TCNT2 (0xB2)   (SRAM)      Timer/Counter2 (8-Bit)  Timer/Counter2 is realized as an up counter 

#define TCNT27  (7)     // Data Bit
#define TCNT26  (6)     // Data Bit
#define TCNT25  (5)     // Data Bit
#define TCNT24  (4)     // Data Bit
#define TCNT23  (3)     // Data Bit
#define TCNT22  (2)     // Data Bit
#define TCNT21  (1)     // Data Bit
#define TCNT20  (0)     // Data Bit


//############################################
//# OCR2A  (0xB3)  (SRAM)      Timer/Counter2 Output Compare Register A (8-Bit) 

#define OCR2A7  (7)     // Data Bit
#define OCR2A6  (6)     // Data Bit
#define OCR2A5  (5)     // Data Bit
#define OCR2A4  (4)     // Data Bit
#define OCR2A3  (3)     // Data Bit
#define OCR2A2  (2)     // Data Bit
#define OCR2A1  (1)     // Data Bit
#define OCR2A0  (0)     // Data Bit


//############################################
//# OCR2B  (0xB4)  (SRAM)      Timer/Counter2 Output Compare Register B (8-Bit) 

#define OCR2B7  (7)     // Data Bit
#define OCR2B6  (6)     // Data Bit
#define OCR2B5  (5)     // Data Bit
#define OCR2B4  (4)     // Data Bit
#define OCR2B3  (3)     // Data Bit
#define OCR2B2  (2)     // Data Bit
#define OCR2B1  (1)     // Data Bit
#define OCR2B0  (0)     // Data Bit




//######################### 
//# 0xB5 (SRAM)  reserved #
//#########################


//############################################
//# ASSR  (0xB6)   (SRAM)     ASSR – Asynchronous Status Register 

// bit 7  reserved , read as zero, write as zero
#define EXCLK    (6)     // Enable External Clock Input
#define AS2      (5)     // Asynchronous Timer/Counter2
#define TCN2UB   (4)     // Timer/Counter2 Update Busy
#define OCR2AUB  (3)     // Output Compare Register2 Update Busy
#define OCR2BUB  (2)     // Output Compare Register2 Update Busy
#define TCR2AUB  (1)     // Timer/Counter Control Register2 Update Busy
#define TCR2BUB  (0)     // Timer/Counter Control Register2 Update Busy



//######################### 
//# 0xB7 (SRAM)  reserved #
//#########################


//############################################
//# TWBR  (0xB8)   (SRAM)     2-wire Serial Interface Bit Rate Register TWI

#define TWBR7  (7)     // Data Bit
#define TWBR6  (6)     // Data Bit
#define TWBR5  (5)     // Data Bit
#define TWBR4  (4)     // Data Bit
#define TWBR3  (3)     // Data Bit
#define TWBR2  (2)     // Data Bit
#define TWBR1  (1)     // Data Bit
#define TWBR0  (0)     // Data Bit



//############################################
//# TWSR  (0xB9) (SRAM)      TWSR – TWI Status Register

#define TWS7  (7)     // TWI Status Bits
#define TWS6  (6)     // '
#define TWS5  (5)     // '
#define TWS4  (4)     // '
#define TWS3  (3)     // '
// bit 2  reserved , read as zero, write as zero
#define TWPS1  (1)     // TWI Prescaler Bits
#define TWPS0  (0)     // '


//############################################
//# TWAR  (0xBA) (SRAM)     TWAR – TWI (Slave) Address Register

#define TWA6  (7)     // TWI (Slave) Address Register
#define TWA5  (6)     // '
#define TWA4  (5)     // '
#define TWA3  (4)     // '
#define TWA2  (3)     // '
#define TWA1  (2)     // '
#define TWA0  (1)     // '
#define TWGCE  (0)    // TWI General Call Recognition Enable Bit



//############################################
//# TWDR  (0xBB)   (SRAM)     2-wire Serial Interface Data Register ( TWI)

#define TWD7  (7)     // Data Bit
#define TWD6  (6)     // Data Bit
#define TWD5  (5)     // Data Bit
#define TWD4  (4)     // Data Bit
#define TWD3  (3)     // Data Bit
#define TWD2  (2)     // Data Bit
#define TWD1  (1)     // Data Bit
#define TWD0  (0)     // Data Bit


//############################################
//# TWCR  (0xBC)  (SRAM)    TWCR – TWI Control Register

#define TWINT  (7)     // TWI Interrupt Flag
#define TWEA   (6)     // TWI Enable Acknowledge Bit
#define TWSTA  (5)     // TWI START Condition Bit
#define TWSTO  (4)     // TWI STOP Condition Bit
#define TWWC   (3)     // TWI Write Collision Flag
#define TWEN   (2)     // TWI Enable Bit
// bit 1  reserved , read as zero, write as zero
#define TWIE   (0)     // TWI Interrupt Enable


//############################################
//# TWAMR  (0xBD)  (SRAM)      TWI (Slave) Address Mask Register

#define TWAM6  (7)     // TWI Address Mask Bits
#define TWAM5  (6)     // '
#define TWAM4  (5)     // '
#define TWAM3  (4)     // '
#define TWAM2  (3)     // '
#define TWAM1  (2)     // '
#define TWAM0  (1)     // '
// bit 0  reserved , read as zero, write as zero


//################################# 
//# 0xBE  - 0xBF (SRAM)  reserved #
//#################################


//############################################
//# UCSR0A  (0xC0)   (SRAM)   UCSR0A-  USART Control and Status Register 0 A

#define RXC0   (7)     // USART Receive Complete
#define TXC0   (6)     // USART Transmit Complete
#define UDRE0  (5)     // USART Data Register Empty
#define FE0    (4)     // Frame Error
#define DOR0   (3)     // Data OverRun
#define UPE0   (2)     // USART Parity Error
#define U2X0   (1)     // Double the USART Transmission Speed
#define MPCM0  (0)     // Multi-processor Communication Mode



//############################################
//# UCSR0B  (0xC1)   (SRAM)   UCSR0B-  USART Control and Status Register 0 B

#define RXCIE0  (7)     // RX Complete Interrupt Enable 0
#define TXCIE0  (6)     // TX Complete Interrupt Enable 0
#define UDRIE0  (5)     // USART Data Register Empty Interrupt Enable 0
#define RXEN0   (4)     // Receiver Enable 0
#define TXEN0   (3)     // Transmitter Enable 0
#define UCSZ02  (2)     // Character Size 0
#define RXB80   (1)     // Receive Data Bit 8 0
#define TXB80   (0)     // Transmit Data Bit 8 0


//############################################
//# UCSR0C  (0xC2)   (SRAM)   UCSR0C-  USART Control and Status Register 0 C

#define UMSEL01  (7)     // USART Mode Select Bits
#define UMSEL00  (6)     // '
#define UPM01    (5)     // Parity Mode Bits
#define UPM00    (4)     // '
#define USBS0    (3)     // Stop Bit Select

