geier99/IR-NEC-Reader/inc/atmega48bit.h
#define UCSZ01   (2)     // Character Size Bits
#define UCSZ00   (1)     // '
#define UDORD0   (2)     // Data Order
#define UCPHA0   (1)     // Clock Phase

#define UCPOL0   (0)     // Clock Polarity



//######################### 
//# 0xC3 (SRAM)  reserved #
//#########################


//############################################
//# UBRR0L  (0xC4)   (SRAM)    USART 0  Baud Rate Register Low Byte

#define UBRR07  (7)     // Data Bit
#define UBRR06  (6)     // Data Bit
#define UBRR05  (5)     // Data Bit
#define UBRR04  (4)     // Data Bit
#define UBRR03  (3)     // Data Bit
#define UBRR02  (2)     // Data Bit
#define UBRR01  (1)     // Data Bit
#define UBRR00  (0)     // Data Bit



//############################################
//# UBRR0H  (0xC5)   (SRAM)    USART 0  Baud Rate Register High Byte

// bits 7 - 4 reserved , read as zero, write as zero
#define UBRR011  (3)     // Data Bit
#define UBRR010  (2)     // Data Bit
#define UBRR09   (1)     // Data Bit
#define UBRR08   (0)     // Data Bit



//############################################
//# UDR0  (0xC6)   (SRAM)    USART 0 I/O Data Register

#define UDR07  (7)     // Data Bit
#define UDR06  (6)     // Data Bit
#define UDR05  (5)     // Data Bit
#define UDR04  (4)     // Data Bit
#define UDR03  (3)     // Data Bit
#define UDR02  (2)     // Data Bit
#define UDR01  (1)     // Data Bit
#define UDR00  (0)     // Data Bit


//################################# 
//# 0xC7  - 0xFF (SRAM)  reserved #
//#################################



//###########################
// Constants 
#define RAMEND      0x2FF  // atmega 48      

//#define RAMEND      0x4FF // atmega 88      
//#define RAMEND      0x4FF // atmega 168     


//#define E2END       0x3FF
//#define FLASHEND    0x7FFF

#define sei()  #asm("sei")
#define cli()  #asm("cli")
/*================================= Typedefs ================================*/
/* nothing */

/*============================ global variables =============================*/
/* nothing */

/*======================= prototyps of global functions =====================*/
/* nothing */

#endif /* #ifndef __ATMEGA48BIT_H */
